using System;
using System.Collections.Generic;

namespace SmartHotel220.Services.Hotels.Data.Seed.Generators
{
    /// <summary>
    /// Генератор адресов
    /// </summary>
    public class AddressGenerator
    {
        private static readonly List<string> PostCodes = new List<string> {
            "60014",
            "48047",
            "98801",
            "08861",
            "13126",
            "35124",
            "52001",
            "27804",
            "37643",
            "30040",
            "60515",
            "23139",
            "29680",
            "60621",
            "58102",
            "33569",
            "48089",
            "29550",
            "91733",
            "38017"
        };

        private static readonly List<string> Streets = new List<string> {
            "55 Сталина",
            "99 Вагонников 1-я",
            "87 Сержанта Елизарова",
            "1 Екатерины Бакуниной",
            "5 Театральная",
            "30 Авиамоторная улица",
            "22 Бакунинская",
            "56 Бараньи горки",
            "107 Вагонников 3-я",
            "2 Бадюлина",
            "45 Баженова",
            "21 Бауманская",
            "75 Бебеля",
            "1835 Ленина",
            "972 Университетская",
            "1593 генерала Какогототам",
            "1560 Черёмушки",
            "998 Артёма",
            "281 Алексея",
            "841 Бурьянова",
            "1128 Барклая",
            "1047 Батюнинская",
            "613 Жёлтиковская 1-я",
            "982 Авиаконструктора Микояна",
            "876 Желябова",
            "281 Завокзальная 1-я",
            "661 Весенняя",
            "91 Басовская",
            "1694 Адмирала Макарова",
            "1260 Достоевского",
            "1248 Пушкина",
            "1640 Толстого",
            "494 Абрамцевская",
            "517 Беговая 2-я",
            "2000 Батайская",
            "1988 Дачная",
            "24 Авангардная",
            "267 Заречная",
            "84 Маршала Василевского",
            "1745 Бахрушина",
            "808 Декабристов",
            "903 Бассейная",
            "1096 Лидии Базановой",
            "875 Московская",
            "863 15 лет октября",
            "588 Абрамцевская",
            "1840 Автомоторная",
            "1543 Бахрушина",
            "260 Веселова",
            "303 Авиаконструктора Яковлева",
            "54 Бажова",
            "1921 Баррикадная",
            "500 Железнодорожников",
            "845 Адмирала Лазарева"
        };
        
        private readonly Stack<string> _availableStreets = new Stack<string>(Streets);

        public string GetPostCode()
        {
            var random = new Random();
            var index = random.Next(PostCodes.Count - 1);

            return PostCodes[index];
        }

        public string GetStreet()
        {
            return _availableStreets.Pop();
        } // GetStreet
    } // AddressGenerator
}