package com.smarthotel220.reviews.seeders;

import java.util.ArrayList;
import java.util.Calendar;
import java.util.GregorianCalendar;
import java.util.List;

import com.smarthotel220.reviews.models.Review;
import com.smarthotel220.reviews.repositories.ReviewRepository;

import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.context.event.ContextRefreshedEvent;
import org.springframework.context.event.EventListener;
import org.springframework.jdbc.core.JdbcTemplate;
import org.springframework.stereotype.Component;

/**
 * Для заполнения базы
 */
@Component
public class ReviewSeeder {

    // Для упрощённой работы с JDBC
    private JdbcTemplate jdbcTemplate;
    // Репозиторий отзывов
    private ReviewRepository reviewRepository;

    private final int MAX_DAY_OF_MONTH = 15;
    private final int MAX_HOTEL_ID = 42;
    // Отзывы
    private List<String> reviews;
    // Имена
    private List<String> names;
    // Фамилии
    private List<String> familyNames;

    // @Autowired - помечает конструктор, поля, геттеры/сеттеры или конфигурационный метод, 
    // который должен быть настроен средствами внедрения зависимостей Spring
    @Autowired
    public ReviewSeeder(ReviewRepository reviewRepository, JdbcTemplate jdbcTemplate) {
        this.reviewRepository = reviewRepository;
        this.jdbcTemplate = jdbcTemplate;

        this.reviews = new ArrayList<>();
        this.names = new ArrayList<>();
        this.familyNames = new ArrayList<>();
        
        this.reviews.add("Отличное расположение, действительно приятные и чистые номера, но то, что делает это место отличным для проживания, - это персонал. Все люди невероятно дружелюбны и щедры. Мы путешествовали с двумя шестилетними детьми и большим количеством багажа, и это было одно из самых прекрасных мест, где мы остались.");
        this.reviews.add("Отличное расположение. Хорошие номера, лифт, хороший завтрак, чистота. Персонал был очень полезным, вежливым. Отель организовал нам экскурсии по музеям. Всего в пяти минутах ходьбы от железнодорожного вокзала. Отель организовал встречу с нами в аэропорту.");
        this.reviews.add("Самый дружелюбный и услужливый регистратор когда-либо, так прекрасное и великолепное первое впечатление от отеля. Не мог быть более сладким, давая мне указания на функцию, которую я посещал вместе с полезной картой, обеспечение парковки на стоянке и облегчение раннего заселения. Если ничего не случилось с отелем, эта леди обеспечила бы, что я оставил бы с хорошим впечатлением. К счастью, все об отеле было исключительным, и я не хвалил легко. Он был чистым, стильным, вместительным и отличным сервисом в обоих барах, где мы обедали и тратили ресторан, где мы обедали. Еда была отличной и отличной ценой и обслуживанием в обоих местах внимательным и эффективным. Сама комната была хорошо оборудована и удобна. Я мог бы продолжить, но хватило, чтобы сказать, что я был очень доволен моим пребыванием, и хотя на этот раз он был коротким и сладким, я надеюсь вернуться в будущем.");
        this.reviews.add("Отличный персонал, который знает истинную ценность обслуживания клиентов, особенно для приема и обслуживания первоклассного ресторана, вечернее меню было разнообразным, а еда исключительная. Кофе-бромель был божественным");
        this.reviews.add("Очень красивая гостиница в нескольких минутах ходьбы от железнодорожного вокзала. Интерьеры красивы, а завтрак поражает. У фронт-офиса есть красивое фортепьяно и прекрасная площадка для сидения. Вечером они подают бесплатные закуски. В целом, отличное место для проживания");
        this.reviews.add("Место было чистое и красивое. Персонал очень хороший. Комната и ванная были очень просторны и красивы. Завтрак в течение утра был отличным. Когда когда-либо нам нужно что-то и просить об этом, это делается сразу. Сотрудники всегда спрашивали о наших потребностях. Было бы обязательно остаться здесь снова и порекомендует это место тоже.");
        this.reviews.add("Отель очень ухоженный, номера очень чистые и удобные, персонал очень профессиональный и дружелюбный, всегда активно предлагая свою помощь, чтобы сделать мое пребывание максимально комфортным. Это отличное соотношение цены и качества. Настоятельно рекомендуется всем.");
        this.reviews.add("Отличный сервис, действительно хороший завтрак и номера. Персонал очень вежливый, и собственность действительно мирная, несмотря на то, что она находится прямо в центре города. Обязательно вернусь :)");
        this.reviews.add("Отличный сервис, очень приветливый персонал, очень чистое место и множество ресторанов. Спа-сервис был очень хорошим. Любил еду в отеле The Lion King и гамбургеры из The Burger Paradise.");
        this.reviews.add("Отличный отель, очень дружелюбный и внимательный персонал, удобное расположение, быстрое обслуживание в номерах, очень чистые номера. Я очень рекомендую этот отель всем.");
        this.reviews.add("В целом не могу придумать одну вещь, которая не была бы чем-то негативным из этого отеля .. 10 из 10 для меня ..! Большой ! Обязательно вернется снова.");
        this.reviews.add("Фантастический отель с исключительным и спокойным садом и прекрасным бассейном! Замечательный персонал, обслуживание и внимание к деталям! очень хорошие предложения. Исключительный опыт.");
        this.reviews.add("Сервис был безупречен во всем, и нам также была предоставлена ранняя регистрация с обновлением номера. Интерьеры красивы, и комната и кровать были удобными.");
        this.reviews.add("Любил опыт по-настоящему. Дружелюбный персонал. Прекрасная автоматизация в спальнях. Все было просто отлично в этом месте. Я очень рекомендую этот отель.");
        this.reviews.add("Этот отель просто замечательный. Персонал замечательный, каждый. Я не встретил одного сотрудника, который был всего лишь средним. Все пытались дать 100% и очень полезно. Бар и рестораны просто выдающиеся в области качества и обслуживания. Сад очень красивый и ухоженный. Это так приятно видеть орлов в некоторых больших гнездах деревьев. Лобби - прекрасное место, где можно посидеть и пообщаться с друзьями. Аромат в Лобби невероятен. Ежедневное обслуживание номеров отлично.");
        this.reviews.add("Удивительный опыт в удивительном отеле, принадлежащем к удивительной группе. Я не мог быть счастливее. Замечательное обслуживание, супер еда, прекрасный мирный бассейн, потрясающий тренажерный зал, красивые номера, в окружении зелени");
        this.reviews.add("Это действительно должно быть одним из самых лучших отелей в мире. Профессионализм персонала и уровень объектов просто не имеют себе равных. У меня было отличное пребывание, и я с нетерпением жду возвращения");
        this.reviews.add("Персонал был необычайно отобран и хорошо подготовлен. Завтрак отличается превосходным качеством и широтой предложения. Ничто не оставалось случайным, объект прекрасен и оазис в центре Бангалора. Отличная позиция - этот отель стоит остановиться.");
        this.reviews.add("Любимое все :) Отличный персонал, сказочные номера и новейшие удобства, ожидал, что это здорово, но это было потрясающе");
        this.reviews.add("Этот отель является жемчужиной, в основном из-за доброты персонала и персонального внимания, которое они оказывают гостям. Кровати супер удобные, завтрак вкусный, сад хорошо сохранен. Комната обслуживается два раза в день, и они постоянно предлагают вам небольшие подарки, фрукты, настои. Они побаловать вас до конца.");
        this.reviews.add("Персонал был искренне дружелюбным, отличный сервис, прекрасный номер и сад. Очень хорошая ценность! Еда была отличной и дорогой по сравнению с внешним рестораном ... и стоило потратить больше.");
        this.reviews.add("Завтрак был превосходным со всеми видами пищи. Не мог быть с большим разнообразием! Также очень чистые номера и очень любезный персонал");
        this.reviews.add("Я путешествовал с мамой, и она любила абсолютно все. Место идеально подходит, так как все близко. Персонал очень дружелюбный и вежливый, с вами будут обращаться как с роялти.");
        this.reviews.add("Ничего не нравится. Мы приехали сюда на нашу годовщину свадьбы, и они не оставили никаких подробностей без присмотра. Мы чувствовали себя как королевская семья и все же как семья. Он был в высшей степени расслабляющим, но элегантным. Мы не можем ждать, чтобы вернуться.");
        this.reviews.add("Все было здорово. Персонал, обслуживание, чистота, завтрак, соотношение цены и качества .... Мы никогда не слышали слова «нет» от их сотрудников. Они предлагали все наши запросы, как только могли. Конечно, мы вернемся!");
        this.reviews.add("Отличное место для отдыха и фантастический персонал, готовый помочь в любое время. очень оперативно с их услугами.");
        this.reviews.add("Номер был очень удобен и чист. Обслуживание в номерах было отличным. Они даже отправили нам пирог на нашу годовщину. У туалетов была паровая камера. Сад и бассейн были хороши. В целом был потрясающий опыт.");
        this.reviews.add("Это 5-звездочный отель с обслуживанием 6 звезд. Отличные номера, приветливый персонал, очень внимательные, высококачественные продукты, которые были хорошо представлены. Помещение, столовая и гостиная были в хорошем состоянии. После пребывания в трех других отелях в том же городе это мой выбор и настоятельно рекомендуется. Очень впечатляющее управление.");
        this.reviews.add("Не было ничего, что хотелось бы, - персонал был таким добрым и заставил нас почувствовать себя особенным в пятизвездочном отеле. Один из лучших отелей, где я когда-либо был.");
        this.reviews.add("SmartHotel220 - это класс. все их отели и услуги - это оценка A++. Рекомендовано 100%.");
        this.reviews.add("Персонал был замечательный. Безопасность была довольно удивительной, а еда - вкусной! В комнате было чисто. Хорошо спроектированный, чистый и очень удобный!");
        this.reviews.add("Услуга абсолютно незабываема. О каждой детали сразу позаботились.");
        this.reviews.add("Завтрак был превосходным. И повышенная внимательность и забота персонала сделали его еще более интересным.");
        this.reviews.add("Я был в шоке от усовершенствованной автоматизации помещений, и это подключение и управление с помощью моего мобильного! Удивительно!");
        this.reviews.add("Лучший опыт в отеле, который у меня когда-либо был! Исключительные люди, обслуживающие вас в ресторанах и домашнем хозяйстве");
        this.reviews.add("Выходите из отеля, предлагая большие преимущества. Персонал дружелюбный и очень профессиональный. Завтрак качественный и очень разнообразный. Пришел с нашей собакой!");
        this.reviews.add("Я много путешествую по делам, и, честно говоря, этот отель очень приятный и выше среднего. Персонал очень дружелюбный, гостиничный номер большой (у нас был семейный номер с 1 двуспальной кроватью и диваном-кроватью), красивый и очень современный. Завтрак - отличный выбор.");
        this.reviews.add("Отличный отель в центре и прямо напротив главного вокзала. Чистый, очень тихий и дружелюбный персонал. Отличная комната с хорошей кроватью и идеальной ванной комнатой. Отличный завтрак!");
        this.reviews.add("В этом месте все просто потрясающе. Вы не хотите идти домой после приезда сюда. Сервис, атмосфера, люди, еда, которую вы называете, и все это прекрасно! Удивительный опыт.");

        this.names.add("Masha");
        this.names.add("Vasya");
        this.names.add("Petya");
        this.names.add("Misha");
        this.names.add("Lisa");
        this.names.add("Stiv");
        this.names.add("Bart");
        this.names.add("Ingrit");
        this.names.add("Joe");
        this.names.add("John");
        this.names.add("Alexey");
        this.names.add("Crayg");
        this.names.add("Clark");
        this.names.add("Ivan");
        this.names.add("Raymond");
        this.names.add("An");
        this.names.add("Hans");
        this.names.add("Cristine");
        this.names.add("Vasilisa");

        this.familyNames.add("Buryanov");
        this.familyNames.add("Tomas");
        this.familyNames.add("Smith");
        this.familyNames.add("Anderson");
        this.familyNames.add("Messi");
        this.familyNames.add("Chen");
        this.familyNames.add("Magarich");
        this.familyNames.add("Erchli");
        this.familyNames.add("Mitrich");
        this.familyNames.add("Stern");
        this.familyNames.add("Li");
        this.familyNames.add("Bell");
        this.familyNames.add("Merphy");
        this.familyNames.add("Brooks");
        this.familyNames.add("Kelly");
        this.familyNames.add("Romanov");
        this.familyNames.add("Gusev");
        this.familyNames.add("Zaharov");
        this.familyNames.add("Zhuravel");
        this.familyNames.add("Condratieva");
        this.familyNames.add("Polyakov");
    }

    // @EventListener - отмечае метод в качестве слушателя для событий приложения.
    // ContextRefreshedEvent - событие, возникающее при инициализации или обновлении ApplicationContext.
    @EventListener
    public void seed(ContextRefreshedEvent event) {
        // Проверяем готовность сидинга
        boolean alreadySeeded = reviewRepository.count() > 0;

        if (alreadySeeded) {
            return;
        }

        // Счётчики
        int nameidx = 0;
        int surnameidx = 0;

        // Генерируем отзывы
        for (int i = 0; i < 500; i++) {
            // Получаем имена
            String name = this.names.get(nameidx);
            String familyName = this.familyNames.get(surnameidx);

            // Инкрементируем счётчик имени
            nameidx++;
            // Если счётчик имён больше либо равно размеру списка имён
            if (nameidx >= this.names.size()) {
                // +1 к счётчику фамилии
                surnameidx++;
                // Сбрасываем счётчик имён
                nameidx = 0;
                // Если счётчик фамилий больше либо равно размеру списка фамилий
                if (surnameidx >= this.familyNames.size()) {
                    // Сбрасываем счётчик фамилий
                    surnameidx = 0;
                } // if
            } // if

            // Формируем отзыв
            Review review = new Review();
            review.setUserId((name.charAt(0) + familyName).toLowerCase() + "@mail.com");
            review.setUserName(name + " " + familyName);
            review.setSubmitted(new GregorianCalendar(2018, Calendar.NOVEMBER, (i%MAX_DAY_OF_MONTH) + 1).getTime());
            review.setHotelId((i%MAX_HOTEL_ID) +1);
            review.setDescription(reviews.get(i%reviews.size()));

            // Сохраняем
            reviewRepository.save(review);
        } // for i
    } // seed
}